OdIfcGUID.#ctor(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a nef IFC GUID based on an existing OdGUID value (copy constructor).
\param other [in] An OdGUID object that is used as a base for creating the IFC GUID object.